In [3]:
# Pandas - Series
import pandas as pd

growth = pd.Series([143,150,157,160], index = ["2018", "2019", "2020", "2020"])
growth
growth["2018"]

143

In [4]:
growth = pd.Series([143,150,157,160])  #뒤에 인덱스값없으면 리스트처럼 나옴
growth
growth[0]

143

In [26]:
# Pandas - DataFrame
## 방법1 - 데이터 생성 후 바로 넣기
index=["2018", "2019", "2020", "2021"]
data = {
    "영희" : [143, 150, 157, 160],
    "철수" : [165, 172, 175, 180]
}
growth = pd.DataFrame(data, columns=["영희", "철수"], index = index)
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [6]:
## 방법2 - 시리즈 만들어서 데이터프레임에 넣기
index=["2018", "2019", "2020", "2021"]
Y = pd.Series([143, 150, 157, 160], index=index)
C = pd.Series([165, 172, 175, 180], index=index)
growth = pd.DataFrame(data, index=index)
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [7]:
# Pandas - DataFrame - astype
print(growth.dtypes)
growth.astype("float")
growth.astype({"영희":"float"})

영희    int64
철수    int64
dtype: object

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [8]:
# Pandas - 데이터 프레임에서 해당 칼럼만 select
growth["영희"]
growth.영희  #growth.영 희 -> 중간에 띄어쓰기있으면 안됨

2018    143
2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [9]:
growth["영희"][0]
growth["영희"][1:]  #리스트 슬라이싱도 가능

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\2981353579.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  growth["영희"][0]

2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [10]:
# Pandas - iloc -> 넘버 기반
growth.iloc[0]  #첫번째 행
growth.iloc[1]  #두번째 행
growth.iloc[[0,2],[0,1]]

       영희   철수
2018  143  165
2020  157  175

In [11]:
# Pandas - loc -> 메모리 기반
growth.loc["2020", "영희"]
growth.loc["2021"]
growth.loc[["2018", "2020"],["영희","철수"]]

       영희   철수
2018  143  165
2020  157  175

In [12]:
# Pandas - read_csv()
pd.read_csv("20241216.csv")
pd.read_csv("20241216.csv", index_col=0)

    A   B  C
0  30  21  9
1  11   2  3

In [13]:
#  Pandas - to_csv()
growth.to_csv("output.csv")
growth.to_csv("output.csv", index = False)

In [14]:
# Pandas - index
growth.set_index("영희")

      철수
영희
143  165
150  172
157  175
160  180

In [15]:
growth.loc[growth.영희>150]

       영희   철수
2020  157  175
2021  160  180

In [27]:
index=["영희", "철수"]
data = {
    "2018" : [143, 165],
    "2019" : [150, 172],
    "2020" : [157, 175],
    "2021" : [160, 180]
}
growth = pd.DataFrame(data, index = index)
growth

    2018  2019  2020  2021
영희   143   150   157   160
철수   165   172   175   180

In [17]:
growth["2019"] = 190
print(growth)

    2018  2019  2020  2021
영희   143   190   157   160
철수   165   190   175   180

In [18]:
import pandas as pd
growth = pd.Series([143,150,157,160], index=["2018","2019","2020","2021"])
growth
print(growth.values)
print(growth.values[0])
print(growth.index)
print(growth.index[0])

[143 150 157 160]
143
Index(['2018', '2019', '2020', '2021'], dtype='object')
2018

In [19]:
growth["2018"].max()

143

In [28]:
growth["2018"].idxmax()  # idxmax() : max의 인덱스를 찾음

'철수'

In [21]:
growth["2018"].argmax()

0

In [29]:
growth["2018"].map(lambda x:x>150)

영희    False
철수     True
Name: 2018, dtype: bool

In [30]:
growth["2018"].map(lambda x:x>150).sum()

1

In [31]:
def check(row):
    if row["2018"] > 160:
        return 2
    elif row["2018"] > 150:
        return 1
    else:
        return 0
    
growth.apply(check, axis = "columns")

영희    0
철수    2
dtype: int64

In [33]:
def check2(col):
    if col["영희"] > 160:
        return 2
    elif col["영희"] > 150:
        return 1
    else:
        return 0

growth.apply(check2, axis = "index")  #index = rows

2018    0
2019    0
2020    1
2021    1
dtype: int64

In [34]:
index = ["영희", "철수", "영철", "순자"]
data = {
    "나이" : [20,20,21,20],
    "지역" : ["서울", "대구", "서울", "서울"],
    "키" : [157,175,180,165]
}
info = pd.DataFrame(data, index = index)
info

    나이  지역    키
영희  20  서울  157
철수  20  대구  175
영철  21  서울  180
순자  20  서울  165

In [35]:
info.groupby("나이").나이.count()

나이
20    3
21    1
Name: 나이, dtype: int64

In [36]:
info.groupby("나이").지역.count()

나이
20    3
21    1
Name: 지역, dtype: int64

In [37]:
info.groupby("나이").키.count()

나이
20    3
21    1
Name: 키, dtype: int64

In [38]:
info.groupby("나이").나이.size()  #나이, 지역, 키, size 어떤걸 넣어도 모두 같은 값이 나옴

나이
20    3
21    1
Name: 나이, dtype: int64

In [39]:
info["나이"].value_counts()  #value_counts랑 size 비슷

나이
20    3
21    1
Name: count, dtype: int64

In [40]:
info.groupby("나이").키.min()

나이
20    157
21    180
Name: 키, dtype: int64

In [41]:
info.groupby("나이", group_keys=True).apply(lambda x: x)

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\4110214980.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  info.groupby("나이", group_keys=True).apply(lambda x: x)

       나이  지역    키
나이
20 영희  20  서울  157
   철수  20  대구  175
   순자  20  서울  165
21 영철  21  서울  180

In [42]:
info.groupby("지역", group_keys=True).apply(lambda x: x)

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\2268593868.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  info.groupby("지역", group_keys=True).apply(lambda x: x)

       나이  지역    키
지역
대구 철수  20  대구  175
서울 영희  20  서울  157
   영철  21  서울  180
   순자  20  서울  165

In [43]:
info.groupby(["지역","나이"]).apply(lambda df:df.loc[df.키.idxmax()])

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\1866847046.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  info.groupby(["지역","나이"]).apply(lambda df:df.loc[df.키.idxmax()])

       나이  지역    키
지역 나이
대구 20  20  대구  175
서울 20  20  서울  165
   21  21  서울  180

In [44]:
info.groupby(["나이","지역"]).apply(lambda df:df.loc[df.키.idxmin()])

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\939495642.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  info.groupby(["나이","지역"]).apply(lambda df:df.loc[df.키.idxmin()])

       나이  지역    키
나이 지역
20 대구  20  대구  175
   서울  20  서울  157
21 서울  21  서울  180

In [45]:
info.groupby('나이').키.agg([len,min,max,sum])

C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\1566419868.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  info.groupby('나이').키.agg([len,min,max,sum])
C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\1566419868.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  info.groupby('나이').키.agg([len,min,max,sum])
C:\Users\soeun\AppData\Local\Temp\ipykernel_8212\1566419868.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  info.groupby('나이').키.agg([len,min,max,sum])

    len  min  max  sum
나이
20    3  157  175  497
21    1  180  180  180

In [46]:
a = info.groupby(['나이','지역']).키.agg([len])
print(a)

       len
나이 지역
20 대구    1
   서울    2
21 서울    1

In [47]:
a.reset_index()

   나이  지역  len
0  20  대구    1
1  20  서울    2
2  21  서울    1

In [48]:
a.sort_values(by='len')

       len
나이 지역
20 대구    1
21 서울    1
20 서울    2

In [49]:
a.sort_index()

       len
나이 지역
20 대구    1
   서울    2
21 서울    1

In [50]:
a.sort_values(by=['나이','len'], ascending=[False, True])

       len
나이 지역
21 서울    1
20 대구    1
   서울    2

In [51]:
a = info.groupby(['지역']).키.agg([len]).sort_index(ascending=False)
print(a)

    len
지역
서울    3
대구    1

In [53]:
index = ["영희", "철수", "영철", "순자", "민수"]
data = {
    "나이": [20, 20, 20, 20, 20],
    "지역": ["서울", "대구", "서울", "서울", "서울"],
    "키": [157, 175, 180, 157, 165]  # 중복된 키 값 157 추가
}
info = pd.DataFrame(data, index=index)

# 결과 확인
size_result = info.groupby(["나이", "지역"]).size()
value_counts_result = info.groupby(["나이", "지역"]).value_counts()

print("Size Result:")
print(size_result)

print("\nValue Counts Result:")
print(value_counts_result)

Size Result:
나이  지역
20  대구    1
    서울    4
dtype: int64

Value Counts Result:
나이  지역  키
20  대구  175    1
    서울  157    2
        165    1
        180    1
Name: count, dtype: int64

In [54]:
# Exercise5 - unknown 
index = ["영희", "철수", "영철", "순자"]
data = {
    "나이" : [20,20,21,20],
    "지역" : ["서울", "대구", "서울", "Unknown"],
    "키" : [157,175,180,None]
}
info = pd.DataFrame(data, index = index)
info

    나이       지역      키
영희  20       서울  157.0
철수  20       대구  175.0
영철  21       서울  180.0
순자  20  Unknone    NaN